# GetButtonCount Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationService..::..GetButtonCount Method
FabricationService Class See Also
---
Gets the number of buttons for a given palette in the service.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public int GetButtonCount(
	int palette
)
```

Visual Basic
---
```text
Public Function GetButtonCount ( _
	palette As Integer _
) As Integer
```

Visual C++
---
```text
public:
int GetButtonCount(
	int palette
)
```

# ### Parameters
palette
    Type: System..::..Int32 The index of the palette
# ### Return Value
The number of buttons.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | The index palette is not larger or equal to 0 and less than PaletteCount. |

# See Also
FabricationService Class
Autodesk.Revit.DB Namespace